# Coding Exercise #0108

### 1. MultiIndex:

In [1]:
import pandas as pd
import numpy as np
import os

#### 1.1. Creating a DataFrame with MultiIndex:

In [3]:
my_header = ['A','B','C']

In [4]:
my_index_out = ['G1']*2 + ['G2']*2 + ['G3']*2
my_index_in = ['a', 'b']*3

In [5]:
my_index_zipped = list(zip(my_index_out, my_index_in))
my_index_zipped

[('G1', 'a'), ('G1', 'b'), ('G2', 'a'), ('G2', 'b'), ('G3', 'a'), ('G3', 'b')]

In [6]:
my_multi_index = pd.MultiIndex.from_tuples(my_index_zipped)
df = pd.DataFrame(data=np.random.randn(6,3),index=my_multi_index,columns=my_header)

In [7]:
df

             A         B         C
G1 a -0.578967  1.138900  1.006094
   b -0.263034  0.107567  0.719976
G2 a  0.255864 -1.197405 -0.707172
   b  2.173828  0.356432  1.671904
G3 a  0.117532  0.359087  1.050920
   b -0.701619 -0.687141  0.695961

#### 1.2. Indexing and slicing DataFrames with MultiIndex:

In [8]:
df.loc['G1']

          A         B         C
a -0.578967  1.138900  1.006094
b -0.263034  0.107567  0.719976

In [9]:
# Indexing followed by another indexing.
df.loc['G1'].loc['a']

A   -0.578967
B    1.138900
C    1.006094
Name: a, dtype: float64

In [10]:
# Indexing followed by another indexing.
df.loc['G1'].loc['a','B']

1.1388998629803013

### 2. DataFrame summarization:

#### 2.1. Group by method:

In [21]:
# Go to the directory where the data file is located. 
os.chdir(r"/Users/anaskanafani/Desktop/SIC/week3")                # Please, replace the path with your own.

In [32]:
df = pd.read_csv('data_studentlist.csv', header='infer')

In [36]:
df.head()

              Name Gender  Age  Grade Absence Bloodtype  Height  Weight
0    Jared Diamond      M   23      3       Y         O   165.3    68.2
1   Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2     Brian Martin      M   24      4       N         B   175.0    80.1
3     David Hassel      M   23      3       N        AB   182.1    85.7
4  Clara Rodriquez      F   20      1       Y         A   168.0    49.5

In [34]:
df.tail()

                Name Gender  Age  Grade Absence Bloodtype  Height  Weight
12      Eddy Johnson      M   21      1       N         A   162.2    55.3
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
14      Linda Carter      F   22      2       N         B   158.2    45.2
15    Richard Swayze      M   24      4       Y         B   168.6    70.2
16       Andrew King      M   21      1       N         A   169.2    62.2

In [44]:
df.groupby('Gender').mean()

/var/folders/ym/ym5xjkt95ld5f15s64_nv81h0000gn/T/ipykernel_67220/4037834431.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('Gender').mean()

              Age     Grade      Height     Weight
Gender
F       21.857143  1.714286  166.642857  50.442857
M       22.700000  2.700000  172.410000  68.500000

In [41]:
df.info() # entries is the number of rows

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       17 non-null     object
 1   Gender     17 non-null     object
 2   Age        17 non-null     int64
 3   Grade      17 non-null     int64
 4   Absence    17 non-null     object
 5   Bloodtype  17 non-null     object
 6   Height     17 non-null     float64
 7   Weight     17 non-null     float64
dtypes: float64(2), int64(2), object(4)
memory usage: 1.2+ KB

In [46]:
df.groupby('Gender')['Height'].mean()

Gender
F    166.642857
M    172.410000
Name: Height, dtype: float64

In [47]:
df.groupby('Gender')[['Height','Weight']].mean()

            Height     Weight
Gender
F       166.642857  50.442857
M       172.410000  68.500000

In [48]:
df.groupby('Gender')[['Grade','Age']].std()

           Grade       Age
Gender
F       0.755929  1.069045
M       1.159502  1.159502

In [49]:
# 25% is the first quartile, 50% is the second quartile, 75% is the third quartile
# (eg. 25% of data or less are below 1.6 , 50% of data or less are below 1.7, 75% of data or less are below 1.8) )
df.groupby('Gender')['Height'].describe()

        count        mean       std    min      25%    50%    75%    max
Gender
F         7.0  166.642857  8.487414  155.2  160.100  168.0  173.1  176.9
M        10.0  172.410000  6.804647  162.2  167.475  172.1  177.9  182.1

In [50]:
sr = df.groupby(['Gender','Bloodtype'])['Height'].mean()     # MultiIndexed result.
sr

Gender  Bloodtype
F       A            172.450000
        AB           170.100000
        B            158.200000
        O            164.433333
M       A            165.700000
        AB           181.050000
        B            174.550000
        O            166.200000
Name: Height, dtype: float64

In [51]:
sr.loc['F']

Bloodtype
A     172.450000
AB    170.100000
B     158.200000
O     164.433333
Name: Height, dtype: float64

In [52]:
sr.loc['F'].loc['A']

172.45

#### 2.2.  DataFrame methods:

In [61]:
df.describe(include='object')

                 Name Gender Absence Bloodtype
count              17     17      17        17
unique             17      2       2         4
top     Jared Diamond      M       N         O
freq                1     10      13         5

In [78]:
df[((df["Age"] >= 5))].Weight.mean()

61.06470588235294

In [54]:
df['Height'].apply(lambda x: x/100)

0     1.653
1     1.701
2     1.750
3     1.821
4     1.680
5     1.620
6     1.552
7     1.769
8     1.785
9     1.761
10    1.671
11    1.800
12    1.622
13    1.761
14    1.582
15    1.686
16    1.692
Name: Height, dtype: float64

In [79]:
df['Height']

0     165.3
1     170.1
2     175.0
3     182.1
4     168.0
5     162.0
6     155.2
7     176.9
8     178.5
9     176.1
10    167.1
11    180.0
12    162.2
13    176.1
14    158.2
15    168.6
16    169.2
Name: Height, dtype: float64

In [80]:
df['Height'] = df['Height'].apply(lambda x: x/100)

In [81]:
df['Height']

0     1.653
1     1.701
2     1.750
3     1.821
4     1.680
5     1.620
6     1.552
7     1.769
8     1.785
9     1.761
10    1.671
11    1.800
12    1.622
13    1.761
14    1.582
15    1.686
16    1.692
Name: Height, dtype: float64

In [55]:
df.sort_values(by='Bloodtype')

                Name Gender  Age  Grade Absence Bloodtype  Height  Weight
16       Andrew King      M   21      1       N         A   169.2    62.2
4    Clara Rodriquez      F   20      1       Y         A   168.0    49.5
12      Eddy Johnson      M   21      1       N         A   162.2    55.3
7    Margareth Jones      F   23      1       N         A   176.9    55.0
1     Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
3       David Hassel      M   23      3       N        AB   182.1    85.7
11      John Matsuda      M   22      2       N        AB   180.0    75.8
14      Linda Carter      F   22      2       N         B   158.2    45.2
9     Jake Timmerman      M   22      2       N         B   176.1    61.3
8       John Bertsch      M   23      3       N         B   178.5    64.2
2       Brian Martin      M   24      4       N         B   175.0    80.1
15    Richard Swayze      M   24      4       Y         B   168.6    70.2
10     Joshua Connor      M   24      4       Y         O   167.1    62.0
6        Susan Clark      F   22      1       N         O   155.2    45.3
5   Jennifer Lorentz      F   21      2       N         O   162.0    52.0
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
0      Jared Diamond      M   23      3       Y         O   165.3    68.2

In [56]:
df.sort_values(by='Bloodtype', ascending=False)

                Name Gender  Age  Grade Absence Bloodtype  Height  Weight
0      Jared Diamond      M   23      3       Y         O   165.3    68.2
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
5   Jennifer Lorentz      F   21      2       N         O   162.0    52.0
6        Susan Clark      F   22      1       N         O   155.2    45.3
10     Joshua Connor      M   24      4       Y         O   167.1    62.0
9     Jake Timmerman      M   22      2       N         B   176.1    61.3
15    Richard Swayze      M   24      4       Y         B   168.6    70.2
14      Linda Carter      F   22      2       N         B   158.2    45.2
8       John Bertsch      M   23      3       N         B   178.5    64.2
2       Brian Martin      M   24      4       N         B   175.0    80.1
1     Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
11      John Matsuda      M   22      2       N        AB   180.0    75.8
3       David Hassel      M   23      3       N        AB   182.1    85.7
7    Margareth Jones      F   23      1       N         A   176.9    55.0
12      Eddy Johnson      M   21      1       N         A   162.2    55.3
4    Clara Rodriquez      F   20      1       Y         A   168.0    49.5
16       Andrew King      M   21      1       N         A   169.2    62.2

In [58]:
df.sort_values(by=['Bloodtype','Gender'])

                Name Gender  Age  Grade Absence Bloodtype  Height  Weight
1     Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
14      Linda Carter      F   22      2       N         B   158.2    45.2
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
4    Clara Rodriquez      F   20      1       Y         A   168.0    49.5
5   Jennifer Lorentz      F   21      2       N         O   162.0    52.0
6        Susan Clark      F   22      1       N         O   155.2    45.3
7    Margareth Jones      F   23      1       N         A   176.9    55.0
0      Jared Diamond      M   23      3       Y         O   165.3    68.2
12      Eddy Johnson      M   21      1       N         A   162.2    55.3
11      John Matsuda      M   22      2       N        AB   180.0    75.8
8       John Bertsch      M   23      3       N         B   178.5    64.2
9     Jake Timmerman      M   22      2       N         B   176.1    61.3
15    Richard Swayze      M   24      4       Y         B   168.6    70.2
3       David Hassel      M   23      3       N        AB   182.1    85.7
2       Brian Martin      M   24      4       N         B   175.0    80.1
10     Joshua Connor      M   24      4       Y         O   167.1    62.0
16       Andrew King      M   21      1       N         A   169.2    62.2

In [62]:
df['Bloodtype'].unique()

array(['O', 'AB', 'B', 'A'], dtype=object)

In [63]:
df['Bloodtype'].nunique() # Return number of unique elements in the object.

4

In [83]:
# Frequency table.
df['Bloodtype'].value_counts() # Return a Series containing counts of unique values.

O     5
B     5
A     4
AB    3
Name: Bloodtype, dtype: int64

In [84]:
# Frequency table.
df['Gender'].value_counts()

M    10
F     7
Name: Gender, dtype: int64

#### 2.3. Pivoting: (means reshaping)

In [85]:
my_dict = {"Size": ["L", "L", "M", "M", "M", "S", "S", "S", "S"],
           "Type": ["A", "A", "A", "B", "B", "A", "A", "B", "B"],
           "Location": ["L1", "L1", "L1", "L2", "L2", "L1", "L2", "L2", "L1"],
           "A": [1, 2, 2, 3, 3, 4, 5, 6, 7],
           "B": [2, 4, 5, 5, 6, 6, 8, 9, 9]}
df = pd.DataFrame(my_dict)
df

  Size Type Location  A  B
0    L    A       L1  1  2
1    L    A       L1  2  4
2    M    A       L1  2  5
3    M    B       L2  3  5
4    M    B       L2  3  6
5    S    A       L1  4  6
6    S    A       L2  5  8
7    S    B       L2  6  9
8    S    B       L1  7  9

In [86]:
# Index by 'Size' and 'Type'. Columns by 'Location'. Values provided by the 'B' column.
dfr = pd.pivot_table(df, index=['Size','Type'], columns='Location', values='B')      
dfr

Location    L1   L2
Size Type
L    A     3.0  NaN
M    A     5.0  NaN
     B     NaN  5.5
S    A     6.0  8.0
     B     9.0  9.0

In [87]:
dfr.columns

Index(['L1', 'L2'], dtype='object', name='Location')

In [88]:
dfr.index                                                                 # MultiIndex object!

MultiIndex([('L', 'A'),
            ('M', 'A'),
            ('M', 'B'),
            ('S', 'A'),
            ('S', 'B')],
           names=['Size', 'Type'])

In [89]:
# The same as above, but fill the missing values with 0.
pd.pivot_table(df, index=['Size','Type'], columns='Location', values='B', fill_value=0)

Location   L1   L2
Size Type
L    A      3  0.0
M    A      5  0.0
     B      0  5.5
S    A      6  8.0
     B      9  9.0

In [92]:
# The same as above with the aggregation function specified.
pd.pivot_table(df, index=['Size','Type'], columns='Location', values='B', aggfunc = np.max, fill_value=0)

Location   L1  L2
Size Type
L    A      4   0
M    A      5   0
     B      0   6
S    A      6   8
     B      9   9

In [93]:
# Index by ''Location'. Columns by 'Size' and 'Type'. Values provided by the 'B' column.
dfr = pd.pivot_table(df, index='Location', columns=['Size','Type'], values='B')
dfr

Size        L    M         S
Type        A    A    B    A    B
Location
L1        3.0  5.0  NaN  6.0  9.0
L2        NaN  NaN  5.5  8.0  9.0

In [94]:
dfr.index

Index(['L1', 'L2'], dtype='object', name='Location')

In [95]:
dfr.columns                                                           # Now, MultiIndex object for the columns.

MultiIndex([('L', 'A'),
            ('M', 'A'),
            ('M', 'B'),
            ('S', 'A'),
            ('S', 'B')],
           names=['Size', 'Type'])

In [96]:
# The aggregation funciton is numpy.median().
pd.pivot_table(df, index=['Size','Type'], columns='Location', values='B', aggfunc = np.median, fill_value=0)

Location   L1   L2
Size Type
L    A      3  0.0
M    A      5  0.0
     B      0  5.5
S    A      6  8.0
     B      9  9.0

In [97]:
# Group averages of the columns 'A' abd 'B'.
pd.pivot_table(df, index=['Size','Type'], values=['A','B'], aggfunc=np.mean)

             A    B
Size Type
L    A     1.5  3.0
M    A     2.0  5.0
     B     3.0  5.5
S    A     4.5  7.0
     B     6.5  9.0

In [98]:
# Now, with groupby() method.
# The result is the same. 
df.groupby(['Size','Type'])[['A','B']].mean()

             A    B
Size Type
L    A     1.5  3.0
M    A     2.0  5.0
     B     3.0  5.5
S    A     4.5  7.0
     B     6.5  9.0

In [99]:
# Aggregate differenly the columns 'A' and 'B'.
pd.pivot_table(df, index=['Size','Type'], values=['A','B'], aggfunc={'A':np.max,'B':np.min})

           A  B
Size Type
L    A     2  2
M    A     2  5
     B     3  5
S    A     5  6
     B     7  9